if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-versions"
    tap "homebrew/cask-fonts"

    # Applications
    # cask "imageoptim" # a tool to optimize images
	cask "1password/tap/1password-cli"
    cask "zulu11"

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "python" # python (latst)
brew "nvm" # Fast Node version manager
brew "yarn" # Even better than node
brew "watchman" # RN file watcher
brew "tree" # pretty-print directory contents
brew "wdiff" # word differences in text files
brew "zsh" # zsh (latest)
brew "zsh"
